In [13]:
import pandas as pd
import requests

In [7]:
limit = 1500
dfMovies = pd.read_json(f'http://localhost:8000/movies?limit={limit}')
dfMovies.set_index('id', inplace=True)
dfMovies

                                                      title  year  duration
id
5257                                              Excuse Me  1915      50.0
6366                                     Anton the Terrible  1916      50.0
8351                        The Mysterious Mrs. Musslewhite  1917      50.0
8384                                           On the Level  1917      50.0
8642                                       The Sunset Trail  1917      50.0
...                                                     ...   ...       ...
11885402           Dan Aykroyd and Tom Hanks: City of Crime  1987       NaN
11911992                           Bleu de Chanel: The Film  2018       1.0
12771922  Neil Cicierega: Vivid Memories Turn to Fantasi...  2014       3.0
12771923                                              Mulan  1998       NaN
12771924                                     No Time To Die  2021       NaN

[1443 rows x 3 columns]

In [25]:
type(dfMovies)

pandas.core.frame.DataFrame

In [10]:
dfStatsMovieByYear = pd.read_json('http://localhost:8000/movies/count_by_year')
dfStatsMovieByYear.columns=['year', 'movie_count']
#dfStatsMovieByYear.set_index('year', inplace=True)
dfStatsMovieByYear

     year  movie_count
0    1915            1
1    1916            1
2    1917            7
3    1918           10
4    1919           10
..    ...          ...
102  2017           22
103  2018           20
104  2019           28
105  2020            6
106  2021            1

[107 rows x 2 columns]

In [12]:
# le résultat n'est pas fameux
dfStatsMovieByDirector = pd.read_json('http://localhost:8000/stars/stats_movie_by_director')
dfStatsMovieByDirector

                                                    0   1
0   {'id': 33, 'name': 'Alfred Hitchcock', 'birthd...  60
1   {'id': 217, 'name': 'Martin Scorsese', 'birthd...  48
2   {'id': 229, 'name': 'Steven Spielberg', 'birth...  41
3   {'id': 142, 'name': 'Clint Eastwood', 'birthda...  39
4   {'id': 361, 'name': 'Brian De Palma', 'birthda...  38
5   {'id': 631, 'name': 'Ridley Scott', 'birthdate...  35
6   {'id': 247, 'name': 'John Woo', 'birthdate': '...  34
7   {'id': 2588606, 'name': 'Steve McQueen', 'birt...  31
8   {'id': 600, 'name': 'Sam Raimi', 'birthdate': ...  31
9   {'id': 406, 'name': 'John Ford', 'birthdate': ...  20
10  {'id': 1392, 'name': 'Peter Jackson', 'birthda...  19
11  {'id': 965, 'name': 'Danny Boyle', 'birthdate'...  18
12  {'id': 233, 'name': 'Quentin Tarantino', 'birt...  14
13  {'id': 116, 'name': 'James Cameron', 'birthdat...  14
14  {'id': 250445, 'name': 'Walter Edwards', 'birt...  14
15  {'id': 102908, 'name': 'Robert N. Bradbury', '...  13
16  {'id': 634240, 'name': 'Christopher Nolan', 'b...  13
17  {'id': 94435, 'name': 'Bong Joon Ho', 'birthda...  12
18  {'id': 1053, 'name': 'Ethan Coen', 'birthdate'...  12
19  {'id': 1054, 'name': 'Joel Coen', 'birthdate':...  11

In [22]:
response = requests.get('http://localhost:8000/stars/stats_movie_by_director')
response

In [23]:
if response.status_code == 200:
    print('Response OK')
else:
    print('Error', response.status_code, response.json(), sep=', ')

Response OK

In [24]:
data_json = response.json()
data_json

[[{'id': 33, 'name': 'Alfred Hitchcock', 'birthdate': '1899-08-13'}, 60],
 [{'id': 217, 'name': 'Martin Scorsese', 'birthdate': '1942-11-17'}, 48],
 [{'id': 229, 'name': 'Steven Spielberg', 'birthdate': '1946-12-18'}, 41],
 [{'id': 142, 'name': 'Clint Eastwood', 'birthdate': '1930-05-31'}, 39],
 [{'id': 361, 'name': 'Brian De Palma', 'birthdate': '1940-09-11'}, 38],
 [{'id': 631, 'name': 'Ridley Scott', 'birthdate': '1937-11-30'}, 35],
 [{'id': 247, 'name': 'John Woo', 'birthdate': '1946-09-22'}, 34],
 [{'id': 2588606, 'name': 'Steve McQueen', 'birthdate': '1969-10-09'}, 31],
 [{'id': 600, 'name': 'Sam Raimi', 'birthdate': '1959-10-23'}, 31],
 [{'id': 406, 'name': 'John Ford', 'birthdate': None}, 20],
 [{'id': 1392, 'name': 'Peter Jackson', 'birthdate': '1961-10-31'}, 19],
 [{'id': 965, 'name': 'Danny Boyle', 'birthdate': '1956-10-20'}, 18],
 [{'id': 233, 'name': 'Quentin Tarantino', 'birthdate': '1963-03-27'}, 14],
 [{'id': 116, 'name': 'James Cameron', 'birthdate': '1954-08-16'}, 14],
 [{'id': 250445, 'name': 'Walter Edwards', 'birthdate': None}, 14],
 [{'id': 102908, 'name': 'Robert N. Bradbury', 'birthdate': None}, 13],
 [{'id': 634240, 'name': 'Christopher Nolan', 'birthdate': '1970-07-30'}, 13],
 [{'id': 94435, 'name': 'Bong Joon Ho', 'birthdate': '1969-09-14'}, 12],
 [{'id': 1053, 'name': 'Ethan Coen', 'birthdate': '1957-09-21'}, 12],
 [{'id': 1054, 'name': 'Joel Coen', 'birthdate': '1954-11-29'}, 11]]

In [27]:
# applatir en liste de tuples
data_flatten = [ (director_dict['id'], director_dict['name'], director_dict['birthdate'], movie_count )  
         for director_dict, movie_count in data_json ]
data_flatten

[(33, 'Alfred Hitchcock', '1899-08-13', 60),
 (217, 'Martin Scorsese', '1942-11-17', 48),
 (229, 'Steven Spielberg', '1946-12-18', 41),
 (142, 'Clint Eastwood', '1930-05-31', 39),
 (361, 'Brian De Palma', '1940-09-11', 38),
 (631, 'Ridley Scott', '1937-11-30', 35),
 (247, 'John Woo', '1946-09-22', 34),
 (2588606, 'Steve McQueen', '1969-10-09', 31),
 (600, 'Sam Raimi', '1959-10-23', 31),
 (406, 'John Ford', None, 20),
 (1392, 'Peter Jackson', '1961-10-31', 19),
 (965, 'Danny Boyle', '1956-10-20', 18),
 (233, 'Quentin Tarantino', '1963-03-27', 14),
 (116, 'James Cameron', '1954-08-16', 14),
 (250445, 'Walter Edwards', None, 14),
 (102908, 'Robert N. Bradbury', None, 13),
 (634240, 'Christopher Nolan', '1970-07-30', 13),
 (94435, 'Bong Joon Ho', '1969-09-14', 12),
 (1053, 'Ethan Coen', '1957-09-21', 12),
 (1054, 'Joel Coen', '1954-11-29', 11)]

In [33]:
# applatir en list de dicts
data_flatten = [ {**director_dict, 'movie_count': movie_count }  
         for director_dict, movie_count in data_json ]
data_flatten

[{'id': 33,
  'name': 'Alfred Hitchcock',
  'birthdate': '1899-08-13',
  'movie_count': 60},
 {'id': 217,
  'name': 'Martin Scorsese',
  'birthdate': '1942-11-17',
  'movie_count': 48},
 {'id': 229,
  'name': 'Steven Spielberg',
  'birthdate': '1946-12-18',
  'movie_count': 41},
 {'id': 142,
  'name': 'Clint Eastwood',
  'birthdate': '1930-05-31',
  'movie_count': 39},
 {'id': 361,
  'name': 'Brian De Palma',
  'birthdate': '1940-09-11',
  'movie_count': 38},
 {'id': 631,
  'name': 'Ridley Scott',
  'birthdate': '1937-11-30',
  'movie_count': 35},
 {'id': 247, 'name': 'John Woo', 'birthdate': '1946-09-22', 'movie_count': 34},
 {'id': 2588606,
  'name': 'Steve McQueen',
  'birthdate': '1969-10-09',
  'movie_count': 31},
 {'id': 600,
  'name': 'Sam Raimi',
  'birthdate': '1959-10-23',
  'movie_count': 31},
 {'id': 406, 'name': 'John Ford', 'birthdate': None, 'movie_count': 20},
 {'id': 1392,
  'name': 'Peter Jackson',
  'birthdate': '1961-10-31',
  'movie_count': 19},
 {'id': 965,
  'name': 'Danny Boyle',
  'birthdate': '1956-10-20',
  'movie_count': 18},
 {'id': 233,
  'name': 'Quentin Tarantino',
  'birthdate': '1963-03-27',
  'movie_count': 14},
 {'id': 116,
  'name': 'James Cameron',
  'birthdate': '1954-08-16',
  'movie_count': 14},
 {'id': 250445,
  'name': 'Walter Edwards',
  'birthdate': None,
  'movie_count': 14},
 {'id': 102908,
  'name': 'Robert N. Bradbury',
  'birthdate': None,
  'movie_count': 13},
 {'id': 634240,
  'name': 'Christopher Nolan',
  'birthdate': '1970-07-30',
  'movie_count': 13},
 {'id': 94435,
  'name': 'Bong Joon Ho',
  'birthdate': '1969-09-14',
  'movie_count': 12},
 {'id': 1053,
  'name': 'Ethan Coen',
  'birthdate': '1957-09-21',
  'movie_count': 12},
 {'id': 1054,
  'name': 'Joel Coen',
  'birthdate': '1954-11-29',
  'movie_count': 11}]

In [34]:
dfStatsMovieByDirector = pd.DataFrame(data_flatten)
dfStatsMovieByDirector.set_index('id', inplace=True)
dfStatsMovieByDirector

                       name   birthdate  movie_count
id
33         Alfred Hitchcock  1899-08-13           60
217         Martin Scorsese  1942-11-17           48
229        Steven Spielberg  1946-12-18           41
142          Clint Eastwood  1930-05-31           39
361          Brian De Palma  1940-09-11           38
631            Ridley Scott  1937-11-30           35
247                John Woo  1946-09-22           34
2588606       Steve McQueen  1969-10-09           31
600               Sam Raimi  1959-10-23           31
406               John Ford        None           20
1392          Peter Jackson  1961-10-31           19
965             Danny Boyle  1956-10-20           18
233       Quentin Tarantino  1963-03-27           14
116           James Cameron  1954-08-16           14
250445       Walter Edwards        None           14
102908   Robert N. Bradbury        None           13
634240    Christopher Nolan  1970-07-30           13
94435          Bong Joon Ho  1969-09-14           12
1053             Ethan Coen  1957-09-21           12
1054              Joel Coen  1954-11-29           11